# Библиотека Pandas

## DataFrame и Serries

pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)

pandas.Series(data=None, index=None, dtype=None, name=None, copy=False)

In [50]:
import pandas as pd
import numpy as np

Создаем произвольный массив

In [51]:
table = np.array((range(4,-3, -2), np.random.choice(range(100), size=4, replace=False)))
table

array([[ 4,  2,  0, -2],
       [50, 51, 71, 81]])

Выбираем произвольную ячейку...

In [52]:
table[1][2]

71

...либо строку целиком

In [53]:
table[0]

array([ 4,  2,  0, -2])

Такая структура простая и понятная, но недостаточно удобная. Например, затруднительно выделять столбецы.


Также на больших объемах данных быстродействие может оказаться недостаточным.

Этих недостатков лишена библиотека Pandas

В pandas реализованы типы данных с разным числом измерений: одномерный тип (просто ряд) называется Series, двумерный (табличка) — DataFrame, трёхмерный — Panel (здесь не рассматриваем).  

Преобразуем массив в DataFrame:

In [54]:
df = pd.DataFrame(table)
df

    0   1   2   3
0   4   2   0  -2
1  50  51  71  81

У такой таблицы можно обращаться к строкам, а можно и к столбцам:

In [55]:
df[1] # ВТОРОЙ столбец

0     2
1    51
Name: 1, dtype: int64

... и по строкам

In [56]:
df.loc[0] # первая строка

0    4
1    2
2    0
3   -2
Name: 0, dtype: int64

И всё  вместе:

In [57]:
df[1].loc[0]

2

## Загрузка датафрейма из CSV-файла
Рассмотрим простой CSV-файл с данными, изображающими результаты нескольких виртуальных студентов по некоторым тестам.

In [58]:
df = pd.read_csv("pandas_exsample.csv")
df

          Предмет  Аня  Петя  Клава  Гриша
0         Алгебра  1.0   2.0    3.0    2.0
1         English  2.3   1.2    3.2    1.2
2      Литература  2.1   2.3    2.3    2.2
3     Физкультура  4.0   2.5    2.4    1.2
4  Обществознание  6.0   5.0    4.0    5.0

In [59]:
df.Аня

0    1.0
1    2.3
2    2.1
3    4.0
4    6.0
Name: Аня, dtype: float64

In [60]:
df["Аня"]

0    1.0
1    2.3
2    2.1
3    4.0
4    6.0
Name: Аня, dtype: float64

Переразгружаем файл и делаем столбец с предметами индексным

In [61]:
df = pd.read_csv("pandas_exsample.csv", index_col=0)
df

                Аня  Петя  Клава  Гриша
Предмет
Алгебра         1.0   2.0    3.0    2.0
English         2.3   1.2    3.2    1.2
Литература      2.1   2.3    2.3    2.2
Физкультура     4.0   2.5    2.4    1.2
Обществознание  6.0   5.0    4.0    5.0

In [62]:
df.loc['Физкультура']

Аня      4.0
Петя     2.5
Клава    2.4
Гриша    1.2
Name: Физкультура, dtype: float64

Строка датафрейма называется «наблюдением» (observation), а столбец — «переменной» (variable). Данные в столбце должны быть однородны (т.е. может быть столбец, состоящий только из чисел или только из строк, но не может быть столбца, в котором перемешаны строки и числа), а по строкам данные могут быть разнородны.

In [63]:
df.index

Index(['Алгебра', 'English', 'Литература', 'Физкультура', 'Обществознание'], dtype='object', name='Предмет')

Не если не хотим видеть имя столбца индексов

In [64]:
df.index.name = None
df.index

Index(['Алгебра', 'English', 'Литература', 'Физкультура', 'Обществознание'], dtype='object')

Клава хочет быть переименованной в Клавдию

In [65]:
df.columns

Index(['Аня', 'Петя', 'Клава', 'Гриша'], dtype='object')

In [66]:
my_columns = list(df.columns)
print(my_columns)
my_columns[2] = 'Клавдия'
print(my_columns)

['Аня', 'Петя', 'Клава', 'Гриша']
['Аня', 'Петя', 'Клавдия', 'Гриша']

In [67]:
df.columns = my_columns
df.columns

Index(['Аня', 'Петя', 'Клавдия', 'Гриша'], dtype='object')

## Срезы
Несмотря на то, что просто квадратные скобки (безо всяких .loc перед ними) позволяют обращаться к столбцам таблицы, те же самые квадратные скобки, используемые вместе со срезами, работают «по строчкам». Например, вот так можно получить вторую и третью строчки таблицы:

In [68]:
df[1:3]

            Аня  Петя  Клавдия  Гриша
English     2.3   1.2      3.2    1.2
Литература  2.1   2.3      2.3    2.2

In [69]:
df['English':'Физкультура']

             Аня  Петя  Клавдия  Гриша
English      2.3   1.2      3.2    1.2
Литература   2.1   2.3      2.3    2.2
Физкультура  4.0   2.5      2.4    1.2

In [70]:
df[['Аня', 'Клавдия']]

                Аня  Клавдия
Алгебра         1.0      3.0
English         2.3      3.2
Литература      2.1      2.3
Физкультура     4.0      2.4
Обществознание  6.0      4.0

А вот так можно с помощью loc[] получить столбец:

In [73]:
df.loc[:, 'Аня']

Алгебра           1.0
English           2.3
Литература        2.1
Физкультура       4.0
Обществознание    6.0
Name: Аня, dtype: float64

## iloc[  ]
Метод loc[  ] работает с именами строк и столбцов, а если нужно использовать их номера, то вызывается метод iloc[  ]

In [74]:
df.iloc[1] # вторая строка

Аня        2.3
Петя       1.2
Клавдия    3.2
Гриша      1.2
Name: English, dtype: float64

In [75]:
df.iloc[:, 2] # третий столбец

Алгебра           3.0
English           3.2
Литература        2.3
Физкультура       2.4
Обществознание    4.0
Name: Клавдия, dtype: float64

In [76]:
df.iloc[1, 2] # ячейка во второй строке, третьем столбце

3.2

## at[  ] и iat[  ]
Обычные квадратные скобки, а также методы loc[  ] и iloc[  ] относительно медленные. Для быстрого обращения к конкретной ячейке используются методы at[] или iat[].

In [77]:
df.at['Литература', 'Аня']

2.1

In [78]:
df.iat[2, 0]

2.1

## Выбор по условию
Предположим, что нам нужно получить все строки, соответствующие тестам, по которым Аня получила оценку выше тройки.

In [79]:
df[df['Аня']>3]

                Аня  Петя  Клавдия  Гриша
Физкультура     4.0   2.5      2.4    1.2
Обществознание  6.0   5.0      4.0    5.0

Этот синтаксис работает примерно так же, как аналогичный синтаксис в np.array. Результатом сравнения df['Ann'] с числом 3 является  pd.Series булевских элементов, являющиеся результатами попарного сравнения элементов df['Ann'] с числом 3

In [80]:
df['Аня']>3

Алгебра           False
English           False
Литература        False
Физкультура        True
Обществознание     True
Name: Аня, dtype: bool

In [81]:
df.loc[:, df.loc['English']>2] 
# выбрать все столбцы, у которых в строке `English` оценка больше двух

                Аня  Клавдия
Алгебра         1.0      3.0
English         2.3      3.2
Литература      2.1      2.3
Физкультура     4.0      2.4
Обществознание  6.0      4.0

In [82]:
df[ (df['Аня'] > 1) & (df['Гриша'] >= 2) ]

                Аня  Петя  Клавдия  Гриша
Литература      2.1   2.3      2.3    2.2
Обществознание  6.0   5.0      4.0    5.0

In [83]:
df.query('Аня > 1 and Гриша > 2')

                Аня  Петя  Клавдия  Гриша
Литература      2.1   2.3      2.3    2.2
Обществознание  6.0   5.0      4.0    5.0

## Мультииндекс

In [84]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
ds = pd.Series(populations, index=index)
ds

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [85]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [86]:
ds = ds.reindex(index)

ds

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [87]:
ds[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [88]:
ds['New York']

2000    18976457
2010    19378102
dtype: int64

In [89]:
ds[:,2000]['New York'] # не изящно

18976457

In [90]:
pop_ds = ds.unstack()
pop_ds

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [91]:
pop_ds.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [92]:
pop_df = pd.DataFrame({'total': ds,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [93]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [94]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2019, 2020], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 57

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2019 1      38.0  57.4  76.0  59.4  53.0  57.4
     2      56.0  58.4  61.0  57.8  68.0  58.0
2020 1      49.0  56.0  56.0  55.5  60.0  57.0
     2      62.0  56.9  61.0  56.0  65.0  57.2

In [95]:
health_data['Guido']

type          HR  Temp
year visit
2019 1      76.0  59.4
     2      61.0  57.8
2020 1      56.0  55.5
     2      61.0  56.0

In [96]:
health_data['Guido', 'HR']

year  visit
2019  1        76.0
      2        61.0
2020  1        56.0
      2        61.0
Name: (Guido, HR), dtype: float64

In [97]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2019 1      38.0  57.4
     2      56.0  58.4

In [98]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2019  1        38.0
      2        56.0
2020  1        49.0
      2        62.0
Name: (Bob, HR), dtype: float64

In [99]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2019 1      38.0  76.0  53.0
2020 1      49.0  56.0  60.0

In [100]:
health_data.to_excel("health_data.xls")